[Killed] BlockStatement
modules/meal/services/create.service.ts:7:58
 export class CreateService {
 	constructor(private mealsRepository: MealsRepository) {}
 
-	async execute(data: CreateMealDTO & { userId: string }) {
-		await this.mealsRepository.create(data)
-	}
+	async execute(data: CreateMealDTO & { userId: string }) {}
 }
 
killedBy: Create Service should create a new meal
statusReason: expected [] to have a length of 1 but got +0
