[Killed] BlockStatement
modules/meal/services/delete-all.service.ts:10:52
 export class DeleteAllService {
 	constructor(private mealsRepository: MealsRepository) {}
 
-	async execute({ userId }: DeleteAllServiceParams) {
-		await this.mealsRepository.deleteAll(userId)
-	}
+	async execute({ userId }: DeleteAllServiceParams) {}
 }
 
killedBy: Delete All Service should delete all meals for a user
statusReason: expected [ { id: 'meal-1', …(6) } ] to have a length of +0 but got 1
