[Killed] BlockStatement
modules/meal/services/delete.service.ts:12:53
 export class DeleteService {
 	constructor(private mealsRepository: MealsRepository) {}
 
-	async execute({ id, userId }: DeleteServiceParams) {
-		const checkIfMealExists = await this.mealsRepository.findById(id, userId)
-
-		if (!checkIfMealExists) {
-			throw new MealNotFoundError()
-		}
-
-		await this.mealsRepository.deleteById(id, userId)
-	}
+	async execute({ id, userId }: DeleteServiceParams) {}
 }
 
killedBy: Delete Service should delete a meal by id
statusReason: expected [ { id: 'meal-1', …(6) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
modules/meal/services/delete.service.ts:15:7
 	async execute({ id, userId }: DeleteServiceParams) {
 		const checkIfMealExists = await this.mealsRepository.findById(id, userId)
 
-		if (!checkIfMealExists) {
+		if (checkIfMealExists) {
 			throw new MealNotFoundError()
 		}
killedBy: Delete Service should delete a meal by id
statusReason: Meal not found

[Killed] BlockStatement
modules/meal/services/delete.service.ts:15:27
 	async execute({ id, userId }: DeleteServiceParams) {
 		const checkIfMealExists = await this.mealsRepository.findById(id, userId)
 
-		if (!checkIfMealExists) {
-			throw new MealNotFoundError()
-		}
+		if (!checkIfMealExists) {}
 
 		await this.mealsRepository.deleteById(id, userId)
killedBy: Delete Service should not delete a meal if it does not exist
statusReason: promise resolved "undefined" instead of rejecting
