[Killed] BlockStatement
modules/meal/services/get-meal-by-id.service.ts:11:58
 export class GetMealByIdService {
 	constructor(private mealsRepository: MealsRepository) {}
 
-	async execute({ id, userId }: GetMealByIdServiceParams) {
-		return this.mealsRepository.findById(id, userId)
-	}
+	async execute({ id, userId }: GetMealByIdServiceParams) {}
 }
 
killedBy: Get Meal By Id Service should return a meal by id
statusReason: expected undefined to be '72689400-c55a-4038-8833-749fc09ade6a' // Object.is equality
