[Killed] BlockStatement
modules/meal/services/list-meals.service.ts:10:52
 export class ListMealsService {
 	constructor(private mealsRepository: MealsRepository) {}
 
-	async execute({ userId }: ListMealsServiceParams) {
-		return this.mealsRepository.getAllMeals(userId)
-	}
+	async execute({ userId }: ListMealsServiceParams) {}
 }
 
killedBy: List Meals Service should return all meals from a user
statusReason: Target cannot be null or undefined.
