[Killed] MethodExpression
modules/meal/services/summary.service.ts:14:23
 		const meals = await this.mealsRepository.getAllMeals(userId)
 
 		const totalMeals = meals.length
-		const mealsOnDiet = meals.filter((meal) => meal.isOnDiet).length
+		const mealsOnDiet = meals.length
 		const mealsOffDiet = totalMeals - mealsOnDiet
 
killedBy: Summary Service should return the correct totals
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArrowFunction
modules/meal/services/summary.service.ts:14:36
 		const meals = await this.mealsRepository.getAllMeals(userId)
 
 		const totalMeals = meals.length
-		const mealsOnDiet = meals.filter((meal) => meal.isOnDiet).length
+		const mealsOnDiet = meals.filter(() => undefined).length
 		const mealsOffDiet = totalMeals - mealsOnDiet
 
killedBy: Summary Service should return the correct totals
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
modules/meal/services/summary.service.ts:15:24
 
 		const totalMeals = meals.length
 		const mealsOnDiet = meals.filter((meal) => meal.isOnDiet).length
-		const mealsOffDiet = totalMeals - mealsOnDiet
+		const mealsOffDiet = totalMeals + mealsOnDiet
 
 		const { maxSequence } = meals.reduce(
killedBy: Summary Service should return the correct totals
statusReason: expected 5 to be 1 // Object.is equality

[Killed] BlockStatement
modules/meal/services/summary.service.ts:18:19
 		const mealsOffDiet = totalMeals - mealsOnDiet
 
 		const { maxSequence } = meals.reduce(
-			(acc, meal) => {
-				if (meal.isOnDiet) {
-					acc.currentSequence++
-				} else {
-					acc.currentSequence = 0
-				}
-
-				acc.maxSequence = Math.max(acc.maxSequence, acc.currentSequence)
-				return acc
-			},
+			(acc, meal) => {},
 			{ currentSequence: 0, maxSequence: 0 }
 		)
killedBy: Summary Service should return the correct totals
statusReason: Cannot destructure property 'maxSequence' of 'meals.reduce(...)' as it is undefined.

[Killed] ConditionalExpression
modules/meal/services/summary.service.ts:19:9
 
 		const { maxSequence } = meals.reduce(
 			(acc, meal) => {
-				if (meal.isOnDiet) {
+				if (true) {
 					acc.currentSequence++
 				} else {
killedBy: Summary Service should return the best sequence on diet
statusReason: expected 6 to be 3 // Object.is equality

[Killed] ConditionalExpression
modules/meal/services/summary.service.ts:19:9
 
 		const { maxSequence } = meals.reduce(
 			(acc, meal) => {
-				if (meal.isOnDiet) {
+				if (false) {
 					acc.currentSequence++
 				} else {
killedBy: Summary Service should return the best sequence on diet
statusReason: expected +0 to be 3 // Object.is equality

[Killed] UpdateOperator
modules/meal/services/summary.service.ts:20:6
 		const { maxSequence } = meals.reduce(
 			(acc, meal) => {
 				if (meal.isOnDiet) {
-					acc.currentSequence++
+					acc.currentSequence--
 				} else {
 					acc.currentSequence = 0
killedBy: Summary Service should return the best sequence on diet
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BlockStatement
modules/meal/services/summary.service.ts:21:12
 			(acc, meal) => {
 				if (meal.isOnDiet) {
 					acc.currentSequence++
-				} else {
-					acc.currentSequence = 0
-				}
+				} else {}
 
 				acc.maxSequence = Math.max(acc.maxSequence, acc.currentSequence)
killedBy: Summary Service should return the best sequence on diet
statusReason: expected 5 to be 3 // Object.is equality

[Killed] MethodExpression
modules/meal/services/summary.service.ts:25:23
 					acc.currentSequence = 0
 				}
 
-				acc.maxSequence = Math.max(acc.maxSequence, acc.currentSequence)
+				acc.maxSequence = Math.min(acc.maxSequence, acc.currentSequence)
 				return acc
 			},
killedBy: Summary Service should return the best sequence on diet
statusReason: expected +0 to be 3 // Object.is equality
