[Killed] BlockStatement
modules/meal/services/update.service.ts:14:59
 export class UpdateService {
 	constructor(private mealsRepository: MealsRepository) {}
 
-	async execute({ data, id, userId }: UpdateServiceParams) {
-		const checkMealExists = await this.mealsRepository.findById(id, userId)
-
-		if (!checkMealExists) {
-			throw new MealNotFoundError()
-		}
-
-		await this.mealsRepository.update(data, id, userId)
-	}
+	async execute({ data, id, userId }: UpdateServiceParams) {}
 }
 
killedBy: Update Service should update a meal
statusReason: expected 'Frango grelhado' to be 'Frango assado' // Object.is equality

[Killed] BlockStatement
modules/meal/services/update.service.ts:17:25
 	async execute({ data, id, userId }: UpdateServiceParams) {
 		const checkMealExists = await this.mealsRepository.findById(id, userId)
 
-		if (!checkMealExists) {
-			throw new MealNotFoundError()
-		}
+		if (!checkMealExists) {}
 
 		await this.mealsRepository.update(data, id, userId)
killedBy: Update Service should throw MealNotFoundError when meal does not exist
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
modules/meal/services/update.service.ts:17:7
 	async execute({ data, id, userId }: UpdateServiceParams) {
 		const checkMealExists = await this.mealsRepository.findById(id, userId)
 
-		if (!checkMealExists) {
+		if (true) {
 			throw new MealNotFoundError()
 		}
killedBy: Update Service should update a meal
statusReason: Meal not found
