[Killed] BlockStatement
modules/user/services/register.service.ts:9:56
 export class RegisterService {
 	constructor(private userRepository: UserRepository) {}
 
-	async execute({ name, email, password }: RegisterDTO) {
-		const checkIfUserExists = await this.userRepository.findByEmail(email)
-
-		if (checkIfUserExists) {
-			throw new UserAlreadyExistsError()
-		}
-
-		const saltOrRounds = 10
-		const hashedPassword = await bcrypt.hash(password, saltOrRounds)
-
-		await this.userRepository.create({
-			name,
-			email,
-			password: hashedPassword
-		})
-	}
+	async execute({ name, email, password }: RegisterDTO) {}
 }
 
killedBy: Register Service should register a new user
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
modules/user/services/register.service.ts:12:7
 	async execute({ name, email, password }: RegisterDTO) {
 		const checkIfUserExists = await this.userRepository.findByEmail(email)
 
-		if (checkIfUserExists) {
+		if (false) {
 			throw new UserAlreadyExistsError()
 		}
killedBy: Register Service should not register a user with an already existing email
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
modules/user/services/register.service.ts:12:26
 	async execute({ name, email, password }: RegisterDTO) {
 		const checkIfUserExists = await this.userRepository.findByEmail(email)
 
-		if (checkIfUserExists) {
-			throw new UserAlreadyExistsError()
-		}
+		if (checkIfUserExists) {}
 
 		const saltOrRounds = 10
killedBy: Register Service should not register a user with an already existing email
statusReason: promise resolved "undefined" instead of rejecting
