[Killed] BlockStatement
modules/user/services/session.service.ts:9:49
 export class SessionService {
 	constructor(private userRepository: UserRepository) {}
 
-	async execute({ email, password }: SessionDTO) {
-		const user = await this.userRepository.findByEmail(email)
-
-		if (!user) {
-			throw new InvalidCredentialsError()
-		}
-
-		const doesPasswordMatches = await bcrypt.compare(password, user.password)
-
-		if (!doesPasswordMatches) {
-			throw new InvalidCredentialsError()
-		}
-
-		return user
-	}
+	async execute({ email, password }: SessionDTO) {}
 }
 
killedBy: Session Service should login a user
statusReason: Cannot read properties of undefined (reading 'email')

[Killed] BlockStatement
modules/user/services/session.service.ts:12:14
 	async execute({ email, password }: SessionDTO) {
 		const user = await this.userRepository.findByEmail(email)
 
-		if (!user) {
-			throw new InvalidCredentialsError()
-		}
+		if (!user) {}
 
 		const doesPasswordMatches = await bcrypt.compare(password, user.password)
killedBy: Session Service should not login with a non-existing email
statusReason: expected TypeError: Cannot read properties of null… to be an instance of InvalidCredentialsError

[Killed] ConditionalExpression
modules/user/services/session.service.ts:18:7
 
 		const doesPasswordMatches = await bcrypt.compare(password, user.password)
 
-		if (!doesPasswordMatches) {
+		if (false) {
 			throw new InvalidCredentialsError()
 		}
killedBy: Session Service should not login with an incorrect password
statusReason: promise resolved "{ id: '1', name: 'John Doe', …(2) }" instead of rejecting

[Killed] ConditionalExpression
modules/user/services/session.service.ts:18:7
 
 		const doesPasswordMatches = await bcrypt.compare(password, user.password)
 
-		if (!doesPasswordMatches) {
+		if (true) {
 			throw new InvalidCredentialsError()
 		}
killedBy: Session Service should login a user
statusReason: Invalid credentials
